cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'caskroom/versions
# The below is used for maven-delux (allows colorizing of maven)
tap jcgay/jcgay'

brew 'ack'
brew 'coreutils'
brew 'ccze'
brew 'git'
brew 'gifsicle'
brew 'grc'
brew 'imagemagick'
brew 'libgit2'
brew 'openssl'
brew 'maven'
brew 'node'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'spark'
brew 'unrar'
brew 'fasd'
brew 'watch'
brew 'wget'
brew 'p7zip'
brew 'zsh-syntax-highlighting'
brew 'emacs'
brew 'scala'
brew 'sbt'
brew 'dos2unix'
brew 'colordiff'
brew 'python'
brew 'fish'
#brew 'maven-deluxe'

cask 'adium'
cask 'alfred'
cask 'atom'
cask 'android-file-transfer'
cask 'bettertouchtool'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
# A really nice calendar menu app
cask 'itsycal'
#cask 'intellij-idea'
#cask 'seashore'
#cask 'slack'
cask 'vlc'
cask 'jumpcut'
cask 'java'
cask 'java7'
cask 'licecap'
cask 'virtualbox'
#cask 'vagrant'
cask 'sublime-text'
cask 'spectacle'
cask 'iterm2'
cask 'menumeters'
cask 'beyond-compare'
#Another cool editor
cask 'lighttable'
cask 'fluid'
